#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-4-auth-gateway/runs/run-treqcZohDVQ57Ae4

Waiting for the plan to start...

Terraform v1.8.3
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_package: Refreshing...
data.archive_file.lambda_package: Refresh complete after 0s [id=01dafee32e968b211eb5c5b161f53ec78fe58966]
aws_api_gateway_rest_api.g35_microservices: Refreshing state... [id=d8ye0tikhc]
aws_iam_role.g35_microservices_lambda_role: Refreshing state... [id=g35_microservices_lambda-role]
aws_cognito_user_pool.g35_microservices_pool: Refreshing state... [id=us-east-1_GZSrWFTD2]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=g35_microservices_lambda-role-20240511122723102800000001]
aws_lambda_function.html_lambda: Refreshing state... [id=g35_microservices_lf_successfull]
aws_api_gateway_resource.root: Refreshing state... [id=p9chas]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_cognito_user.example: Refreshing state... [id=us-east-1_GZSrWFTD2/new_test]
aws_api_gateway_authorizer.g35_microservices: Refreshing state... [id=u0m1vk]
aws_cognito_user_pool_client.client: Refreshing state... [id=3e2h8el6u4oiqtrr5g1kn3r5af]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-d8ye0tikhc-p9chas-POST]
aws_api_gateway_method.options: Refreshing state... [id=agm-d8ye0tikhc-p9chas-OPTIONS]
aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-d8ye0tikhc-p9chas-POST-200]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-d8ye0tikhc-p9chas-POST]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-d8ye0tikhc-p9chas-OPTIONS-200]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-d8ye0tikhc-p9chas-OPTIONS]
aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-d8ye0tikhc-p9chas-POST-200]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-d8ye0tikhc-p9chas-OPTIONS-200]
aws_api_gateway_deployment.deployment: Refreshing state... [id=sq8yqp]
aws_api_gateway_integration_response.options_integration_response: Drift detected (update)
aws_api_gateway_integration.options_integration: Drift detected (update)
aws_lambda_function.html_lambda: Drift detected (update)
aws_iam_role.g35_microservices_lambda_role: Drift detected (update)
aws_api_gateway_integration_response.proxy: Drift detected (update)
aws_api_gateway_integration.lambda_integration: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.options_integration must be replaced
-/+ resource "aws_api_gateway_integration" "options_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "p9chas" -> (known after apply)
      ~ id                      = "agi-d8ye0tikhc-p9chas-OPTIONS" -> (known after apply)
      + integration_http_method = "OPTIONS" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @assouza19, Action: `pull_request`*